Revit 2026 API

# DividedPathAreCurveReferencesConnected Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool AreCurveReferencesConnected(
	Document document,
	IList<Reference> curveReferences
)
```
```vb
Public Shared Function AreCurveReferencesConnected (
	document As Document,
	curveReferences As IList(Of Reference)
) As Boolean
```
```cpp
public:
static bool AreCurveReferencesConnected(
	Document^ document,
	IList<Reference^>^ curveReferences
)
```
```fsharp
static member AreCurveReferencesConnected :
        document : Document *
        curveReferences : IList<Reference> -> bool
```

#### Parameters

document Document

curveReferences IListReference

#### Return Value

Boolean

#### Reference

DividedPath Class

Autodesk.Revit.DB Namespace